In [52]:
import configparser
import psycopg2
from sql_queries import create_table_queries, drop_table_queries

In [53]:
config = configparser.ConfigParser()
config.read('dwh.cfg')

# Connection parameters
DWH_DB= config.get("DWH", "DWH_DB")
DWH_DB_USER= config.get("DWH", "DWH_DB_USER")
DWH_DB_PASSWORD= config.get("DWH", "DWH_DB_PASSWORD")
DWH_PORT= config.get("DWH", "DWH_PORT")
DWH_ENDPOINT = config.get("DWH", "DWH_ENDPOINT")

In [54]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [55]:
conn = "postgresql://{}:{}@{}:{}/{}".format(DWH_DB_USER, DWH_DB_PASSWORD, DWH_ENDPOINT, DWH_PORT,DWH_DB)
print(conn)
%sql $conn

postgresql://dwhadmin:Passw0rdd@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb

In [56]:
%env DATABASE_URL=postgresql://${user}:${password}@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb

env: DATABASE_URL=postgresql://${user}:${password}@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb

In [57]:
%sql SELECT * FROM staging_events_table LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[(6, None, 'Logged In', 'Theodore', 'M', 0, 'Smith', None, 'free', 'Houston-The Woodlands-Sugar Land, TX', 'GET', 'Home', 1540306145796.0, 154, None, 200, 1541290555796, 'Mozilla/5.0 (Windows NT 6.1; WOW64; rv:31.0) Gecko/20100101 Firefox/31.0', 52),
 (14, 'Professor Longhair', 'Logged In', 'Ann', 'F', 0, 'Banks', 214.204, 'free', 'Salt Lake City, UT', 'PUT', 'NextSong', 1540895683796.0, 124, "Mean Ol'World", 200, 1541292603796, 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10.9; rv:31.0) Gecko/20100101 Firefox/31.0', 99),
 (22, None, 'Logged In', 'Jahiem', 'M', 0, 'Miles', None, 'free', 'San Antonio-New Braunfels, TX', 'GET', 'Home', 1540817347796.0, 42, None, 200, 1541299033796, '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', 43),
 (30, 'Gary Hobbs', 'Logged In', 'Jahiem', 'M', 1, 'Miles', 245.524, 'free', 'San Antonio-New Braunfels, TX', 'PUT', 'NextSong', 1540817347796.0, 42, 'En Mi Mundo', 200, 1541300092796, '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', 43),
 (38, 'Lifehouse', 'Logged In', 'Jahiem', 'M', 2, 'Miles', 203.598, 'free', 'San Antonio-New Braunfels, TX', 'PUT', 'NextSong', 1540817347796.0, 42, "We'll Never Know", 200, 1541300337796, '"Mozilla/5.0 (Windows NT 5.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"', 43)]

In [58]:
%sql SELECT COUNT(*) FROM staging_events_table;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(8056,)]

In [59]:
%sql SELECT * FROM staging_songs_table LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[(3, 'SODZYPO12A8C13A91E', 'Burn My Body (Album Version)', 177.998, 0, 'AR1C2IX1187B99BF74', 'Broken Spindles', None, None, '', 1),
 (11, 'SOTAZDY12AB0187616', 'Drillbit', 374.622, 0, 'ARZKCQM1257509D107', 'Dataphiles', None, None, '', 1),
 (19, 'SOIGHOD12A8C13B5A1', 'Indian Angel', 171.572, 2004, 'ARY589G1187B9A9F4E', 'Talkdemonic', 45.5118, -122.676, 'Portland, OR', 1),
 (27, 'SOSFHAT12A58A79EB6', 'Siempre Ana', 234.631, 2002, 'ARE6D0Y119B8667D9F', 'Alejandro Santiago', None, None, '', 1),
 (35, 'SOAADAD12A8C13D5B0', 'One Shot (Album Version)', 263.993, 2005, 'ARQTC851187B9B03AF', 'O.A.R.', 39.0817, -77.1512, 'Rockville, MD', 1)]

In [60]:
%sql SELECT COUNT(*) FROM staging_songs_table;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(14896,)]

In [61]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[(7, 'Adelyn', 'Jordan', 'F', 'free'),
 (4, 'Alivia', 'Terrell', 'F', 'free'),
 (69, 'Anabelle', 'Simpson', 'F', 'free'),
 (90, 'Andrea', 'Butler', 'F', 'free'),
 (99, 'Ann', 'Banks', 'F', 'free')]

In [62]:
%sql SELECT COUNT(*) FROM users;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(97,)]

In [63]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[('SOONYFK12A6D4F442C', ' Dry Techterlech', 'AR2SZ2A1187FB5A5FF', 0, Decimal('232')),
 ('SOPMHBX12A8AE47391', "'39 (Swingin' Utters)", 'AROBOIW11F4C84748F', 0, Decimal('199')),
 ('SOUWPFR12A8C13EEC4', "'Pathétique' Sonata (Op. 13 - II: Adagio Cantabile)", 'ARKU15L1187B99198D', 0, Decimal('324')),
 ('SOANTAD12A6D4F6CCC', "'Round Midnight (Live)", 'ARJEL6T1187B9A0601', 0, Decimal('477')),
 ('SOGZZST12A6D4F6990', "'Til I Can Make It On My Own", 'AR9HFG31187FB37110', 0, Decimal('201'))]

In [64]:
%sql SELECT COUNT(*) FROM songs;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(14896,)]

In [65]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[('ARTW7I31187B9A4CA9', '!!!', '', None, None),
 ('ARRPWJ81187B99FB84', '& And Oceans', '', None, None),
 ('ARY35JW1187B998233', "'68 Comeback", '', None, None),
 ('ARHZZOQ1187B9AE734', "'t Hof Van Commerce", '', None, None),
 ('AR1NRFQ1187B994284', '-123min.', '', None, None)]

In [66]:
%sql SELECT COUNT(*) FROM artists;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(9553,)]

In [67]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 1, 22, 23, 14), 22, 1, 44, 11, 2018, 4),
 (datetime.datetime(2018, 11, 2, 9, 16, 16), 9, 2, 44, 11, 2018, 5),
 (datetime.datetime(2018, 11, 2, 9, 35, 25), 9, 2, 44, 11, 2018, 5),
 (datetime.datetime(2018, 11, 2, 9, 40, 11), 9, 2, 44, 11, 2018, 5),
 (datetime.datetime(2018, 11, 2, 9, 54, 59), 9, 2, 44, 11, 2018, 5)]

In [68]:
%sql SELECT COUNT(*) FROM time;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(8056,)]

In [69]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.

[(44, 1541345976796, '78', 'free', 'SOBONKR12A58A7A7E0', 'AR5E44Z1187B9A1D74', 176, 'Indianapolis-Carmel-Anderson, IN', 'Mozilla/5.0 (Windows NT 6.1; rv:31.0) Gecko/20100101 Firefox/31.0'),
 (1324, 1541803618796, '88', 'free', 'SOBONKR12A58A7A7E0', 'AR5E44Z1187B9A1D74', 325, 'Sacramento--Roseville--Arden-Arcade, CA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (476, 1542200188796, '62', 'free', 'SOHTKMO12AB01843B0', 'AR5EYTL1187B98EDA0', 476, 'Houston-The Woodlands-Sugar Land, TX', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10) AppleWebKit/538.46 (KHTML, like Gecko) Version/8.0 Safari/538.46"'),
 (1564, 1542729001796, '100', 'free', 'SOHTKMO12AB01843B0', 'AR5EYTL1187B98EDA0', 595, 'New York-Newark-Jersey City, NY-NJ-PA', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.78.2 (KHTML, like Gecko) Version/7.0.6 Safari/537.78.2"'),
 (348, 1541267941796, '15', 'paid', 'SOHTKMO12AB01843B0', 'AR5EYTL1187B98EDA0', 199, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [70]:
%sql SELECT COUNT(*) FROM songplays;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
1 rows affected.

[(319,)]

## Sanity Check

### Check Table Names

In [71]:
import sql_queries as sqlq

In [72]:
%%sql _tablenames <<
SELECT tablename 
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND schemaname != 'information_schema' AND tableowner = 'dwhadmin';

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
7 rows affected.
Returning data to local variable _tablenames

In [73]:
tablenames = _tablenames.DataFrame()

In [74]:
user_table = [name for name in list(tablenames.tablename) if name in sqlq.user_table_create][0]
song_table = [name for name in list(tablenames.tablename) if name in sqlq.song_table_create][0]
artists_table = [name for name in list(tablenames.tablename) if name in sqlq.artist_table_create][0]
songplay_table = [name for name in list(tablenames.tablename) if name in sqlq.songplay_table_create][0]
staging_events_table = [name for name in list(tablenames.tablename) if name in sqlq.staging_events_table_create][0]

## Run Primary Key Test

In [75]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                    AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{user_table}'::regclass;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
(psycopg2.errors.WrongObjectType) op ANY/ALL (array) requires array on right side

[SQL: SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary FROM pg_index i JOIN pg_attribute a ON a.attrelid = i.indrelid AND a.attnum = ANY(i.indkey) WHERE i.indrelid = 'users' ::regclass;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [89]:
if not _output:
    print('\033[93m'+'[WARNING] '+ f"The {user_table} table does not have a primary key!")

In [90]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{artists_table}'::regclass

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
(psycopg2.errors.WrongObjectType) op ANY/ALL (array) requires array on right side

[SQL: SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary FROM pg_index i JOIN pg_attribute a ON a.attrelid = i.indrelid AND a.attnum = ANY(i.indkey) WHERE i.indrelid = 'artists' ::regclass]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [91]:
if not _output: 
    print('\033[93m'+'[WARNING] '+ f"The {artists_table} table does not have a primary key!")

In [92]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{songplay_table}'::regclass

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
(psycopg2.errors.WrongObjectType) op ANY/ALL (array) requires array on right side

[SQL: SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary FROM pg_index i JOIN pg_attribute a ON a.attrelid = i.indrelid AND a.attnum = ANY(i.indkey) WHERE i.indrelid = 'songplays' ::regclass]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [93]:
if not _output:
    print('\033[93m'+'[WARNING] '+ f"The {songplay_table} table does not have a primary key!")

In [94]:
%sql _output << SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary \
FROM   pg_index i \
JOIN   pg_attribute a ON a.attrelid = i.indrelid \
                     AND a.attnum = ANY(i.indkey) \
WHERE  i.indrelid = '{song_table}'::regclass

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
(psycopg2.errors.WrongObjectType) op ANY/ALL (array) requires array on right side

[SQL: SELECT a.attname, format_type(a.atttypid, a.atttypmod) AS data_type, a.attnotnull, i.indisprimary FROM pg_index i JOIN pg_attribute a ON a.attrelid = i.indrelid AND a.attnum = ANY(i.indkey) WHERE i.indrelid = 'songs' ::regclass]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [ ]:
if not _output:
    print('\033[93m'+'[WARNING] '+ f"The {song_table} table does not have a primary key!")

## Run Data Type and Constraints Check

In [76]:
%sql _output << SELECT * FROM information_schema.tables WHERE table_schema = 'public';

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
7 rows affected.
Returning data to local variable _output

In [77]:
%sql _output << SELECT * FROM information_schema.columns WHERE table_name = '{user_table}';

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.
Returning data to local variable _output

**Check the column `user_id` for correct data type.**
If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using a different column name. Change the column name below and run the cell again.

In [78]:
output = _output.DataFrame()
_dtype = output[output.column_name == 'user_id'].data_type.iloc[0]
if _dtype not in ['integer', 'bigint']:
    print('\033[93m'+'[WARNING] '+ f"Type {_dtype} may not be an appropriate data type for column 'user_id' in the '{user_table}' table.")

In [79]:
%sql _output << SELECT * FROM information_schema.columns where table_name='{song_table}'

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
5 rows affected.
Returning data to local variable _output

**Check the column `year` for correct data type.
Check columns `title` and `duration` for not-NULL constraints.**

If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using different column names. Change the column name(s) below and run the cell again.

In [80]:
output = _output.DataFrame()

_dtype = output[output.column_name == 'year'].data_type.iloc[0]
if _dtype not in ['integer']:
    print('\033[93m'+'[WARNING] '+ f"Type '{_dtype}' may not be an appropriate data type for column 'year' in the '{song_table}' table.")

_nullable_title = output[output.column_name == 'title'].is_nullable.iloc[0]
_nullable_duration = output[output.column_name == 'duration'].is_nullable.iloc[0]
if (_nullable_duration != 'NO') or (_nullable_title != 'NO'): 
    print('\033[93m'+'[WARNING] '+ f"You may want to add appropriate NOT NULL constraints to the '{song_table}' table.")

[WARNING] Type 'smallint' may not be an appropriate data type for column 'year' in the 'songs' table.

**Check the columns `latitude` and `longitude` for correct data type.
Check column `name` for not-NULL constraint.**

If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using different column names. Change the column name(s) below and run the cell again.

In [81]:
output = _output.DataFrame()

_dtype_latitude = output[output.column_name == 'latitude'].data_type.iloc[0:2]
if _dtype_latitude not in ['double precision']:
    print('\033[93m'+'[WARNING] '+ f"Type '{_dtype_latitude}' may not be an appropriate data type for column 'latitude' in the '{artists_table}' table")

_dtype_longitude = output[output.column_name == 'longitude'].data_type.iloc[0]
if _dtype_longitude not in ['double precision']:
    print('\033[93m'+'[WARNING] '+ f"Type '{_dtype_longitude}' may not be an appropriate data type for column 'longitude' in the '{artists_table}' table")


_nullable_name = output[output.column_name == 'name'].is_nullable.iloc[0]
if _nullable_name != 'NO':
    print('\033[93m'+'[WARNING] '+ f"You may want to add appropriate NOT NULL constraints to the '{artists_table}' table.")

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [82]:
%sql SELECT count(user_id), level, gender FROM users GROUP BY level, gender;

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
4 rows affected.

[(45, 'free', 'F'), (38, 'free', 'M'), (10, 'paid', 'F'), (4, 'paid', 'M')]

In [83]:
%sql _output << SELECT * FROM information_schema.columns where table_name='{songplay_table}'

 * postgresql://dwhadmin:***@sparkifycluster.csnopveq31le.us-west-2.redshift.amazonaws.com:5439/sparkifydb
9 rows affected.
Returning data to local variable _output

**Check the columns `start_time` and `user_id` for correct data type.
Check columns `start_time` and `user_id` for not-NULL constraint.**

If you get a `IndexError: single positional indexer is out-of-bounds` error, you may be using different column names. Change the column name(s) below and run the cell again.

In [84]:
output = _output.DataFrame()

_dtype_start_time = output[output.column_name == 'start_time'].data_type.iloc[0]
if 'timestamp' not in _dtype_start_time: 
    print('\033[93m'+'[WARNING] '+ f"Type '{_dtype_start_time}' may not be an appropriate data type for column 'start_time' in the '{songplay_table}' table.")



_dtype_user_id = output[output.column_name == 'user_id'].data_type.iloc[0]
if _dtype_user_id not in ['integer', 'bigint']:
    print('\033[93m'+'[WARNING] '+ f"Type '{_dtype_user_id}' may not be an appropriate data type for column 'user_id' in the '{songplay_table}' table.")


_nullable_time = output[output.column_name == 'start_time'].is_nullable.iloc[0]
_nullable_uid = output[output.column_name == 'user_id'].is_nullable.iloc[0]

if (_nullable_time != 'NO') or (_nullable_uid != 'NO'):
    print('\033[93m'+'[WARNING] '+ f"You may want to add appropriate NOT NULL constraints to the '{songplay_table}' table.")

[WARNING] Type 'bigint' may not be an appropriate data type for column 'start_time' in the 'songplays' table.
[WARNING] Type 'character varying' may not be an appropriate data type for column 'user_id' in the 'songplays' table.
[WARNING] You may want to add appropriate NOT NULL constraints to the 'songplays' table.

In [85]:
output = _output.DataFrame()

_dtype_ts = output[output.column_name == 'ts'].data_type.iloc[0:1]
if 'timestamp' not in _dtype_ts: 
    print('\033[93m'+'[WARNING] '+ f"Type '{_dtype_ts}' may not be an appropriate data type for column 'ts' in the '{staging_events_table}' table.")

[WARNING] Type 'Series([], Name: data_type, dtype: object)' may not be an appropriate data type for column 'ts' in the 'staging_events_table' table.

## Run Test for Upsertion Check

In [86]:
import re

In [88]:
if not re.search('ON\s+CONFLICT',sqlq.songplay_table_insert,re.IGNORECASE) or \
    not re.search('ON\s+CONFLICT',sqlq.user_table_insert,re.IGNORECASE) or \
    not re.search('ON\s+CONFLICT',sqlq.song_table_insert,re.IGNORECASE) or \
    not re.search('ON\s+CONFLICT',sqlq.artist_table_insert,re.IGNORECASE):
        print('\033[93m'+'[WARNING]Some of your insert queries may need an "ON CONFLICT" clause.')
        print('\033[93m'+'         You can either skip conflicting insertions with with "ON CONFLICT DO NOTHING"')
        print('\033[93m'+'         OR use "ON CONFLICT DO UPDATE SET"')
        print('\033[93m'+'         Check this link for more details: https://www.postgresqltutorial.com/postgresql-upsert/')

[WARNING]Some of your insert queries may need an "ON CONFLICT" clause.
         You can either skip conflicting insertions with with "ON CONFLICT DO NOTHING"
         OR use "ON CONFLICT DO UPDATE SET"
         Check this link for more details: https://www.postgresqltutorial.com/postgresql-upsert/